[LWS_Vanguard X2SoldierClassTemplate]
+DisplayName="前卫"
+ClassSummary="XCOM前卫是活跃在前线的战士，只有少数人能在自动武器和爆炸物的时代掌握近战技巧。他们只携带霰弹枪和可能的盾牌或副武器，先锋可以接受训练以承受更多的攻击、使敌人行动更加困难，或者用他们的霰弹枪将其打成碎片。"
;************************************************************************************************************
;***                                  Note - Vanguards are unique because they gain ablatative HP instead of body HP, meaning they can take hits and still leave to fight again in the next mission, this however makes them super vulnerable to fall damage or armor piercing weapons that would burn through their ablatative and bypass their armor (if they even have it) so armor and vests are more important on these troops. Vanguards are semi-heroic class, like Stormriders or Wardens, meaning they cant be mass made in GTS.***
;************************************************************************************************************
+LeftAbilityTreeTitle="引导风暴"
+RightAbilityTreeTitle="惩罚者"
AbilityTreeTitles[0]="引导风暴"
AbilityTreeTitles[1]="前线"
AbilityTreeTitles[2]="惩罚者"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

[XV_Sidewinder X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="被动触发，完全躲闪一次敌人的直接攻击并获得一个移动行动点数。3回合冷却。"
LocLongDescription="被动触发，完全躲闪一次敌人的直接攻击并获得一个移动行动点数。3回合冷却。"
LocHelpText="被动触发，完全躲闪一次敌人的直接攻击并获得一个移动行动点数。3回合冷却。"
LocPromotionPopupText="<Bullet/> 对毒蛇怪不会触发效果<br/><Bullet/> 不会对反应射击生效<br/><Bullet/>"

[XV_SidewinderCooldown X2AbilityTemplate]
LocLongDescription="士兵在躲避另一次攻击之前需要休息一下。"
LocHelpText="士兵在躲避另一次攻击之前需要休息一下。"

[XV_SidewinderDodge X2AbilityTemplate]
LocFriendlyName="响尾蛇"
LocLongDescription="士兵在躲避另一次攻击之前需要休息一下。"
LocHelpText="士兵在躲避另一次攻击之前需要休息一下。"

[IRI_Rider_Riposte X2AbilityTemplate]
LocLongDescription="使用主武器来抵挡敌人的攻击，这些攻击可能会偏离或擦伤，在<font color='#ff3206'>防御(Guard)</font>处于激活状态时，被动地获得<Ability:RIPOSTE_BONUS_DODGE/>闪避，并抵抗大多数由近战攻击命中造成的损伤。风暴骑士将用他们的刀剑进行攻击，先锋则会用他们的霰弹枪作为临时近战武器。"
LocHelpText="使用主武器来抵挡敌人的攻击，这些攻击可能会偏离或擦伤，在<font color='#ff3206'>防御(Guard)</font>处于激活状态时，被动地获得<Ability:RIPOSTE_BONUS_DODGE/>闪避，并抵抗大多数由近战攻击命中造成的损伤。"
LocPromotionPopupText="<Bullet/> 反击任何在近战范围内进行的攻击，即使是使用远程武器进行的攻击。<br/><bullet/> 反击一个攻击可以完全闪避该次伤害，并自动响应一次反击。<br/><bullet/> 如果敌人对反应射击免疫，则无法进行反击。<br/><bullet/> 反击视为一种反应性进攻；它会受到瞄准惩罚，通常不能造成暴击。<br/><bullet/>反击只能使用主武器造成伤害，即使是双持武器，也不能激活<font color='#ff3206'>交叉打击</font>。<br/><bullet/> 学习反击将使士兵永久免疫由强袭枪兵、异变者和狂战士造成的近战攻击。<br/><bullet/> 如果<font color='#ff3206'>防卫</font>处于激活状态，则其储充能将用于抵挡敌人的攻击。"
